tap "homebrew/services"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bat"
brew "cmatrix"
brew "cowsay"
brew "eza"
brew "fd"
brew "fortune"
brew "gh"
brew "git"
brew "gti"
brew "node", link: false
brew "heroku"
brew "libksba"
brew "libyaml"
brew "nginx"
brew "nmap"
brew "opusfile"
brew "postgresql@14", link: false
brew "postgresql@16", link: true
brew "redis"
brew "ripgrep"
brew "sl"
brew "sox"
brew "swift"
brew "tidy-viewer"
brew "tree"
brew "vapor"
brew "wp-cli"
brew "yarn"
cask "font-jetbrains-mono-nerd-font"
cask "swift-im"
cask "vagrant"
cask "virtualbox"
vscode "anthropic.claude-code"
vscode "b4456609.theme-atom-one-light"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "chrisvltn.vs-code-semicolon-insertion"
vscode "craigmaslowski.erb"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.vscode-swift-syntax"
vscode "felixfbecker.php-intellisense"
vscode "github.copilot-chat"
vscode "hookyqr.beautify"
vscode "ikappas.phpcs"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mattn.runner"
vscode "mohseenrm.lit-it"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.atom-keybindings"
vscode "nextfaze.json-parse-stringify"
vscode "pkief.material-icon-theme"
vscode "rafaelmaiolla.remote-vscode"
vscode "ritwickdey.liveserver"
vscode "sallar.json-to-js-object"
vscode "searking.preview-vscode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sswg.swift-lang"
vscode "stevencl.adddoccomments"
vscode "stubailo.ignore-gitignore"
vscode "swiftlang.swift-vscode"
vscode "techer.open-in-browser"
vscode "vadimcn.vscode-lldb"
vscode "waderyan.gitblame"
vscode "wallabyjs.quokka-vscode"
vscode "xdebug.php-debug"
uv "metabase-mcp"
